/**************************************************************************************
 *		              LED闪烁的简单试验												  *
 *                延时实现p2口LED流水灯效果 （用循环移位指令） 			              *
 *	连接方法： JP11（P2）和J12(LED灯) 用8PIN排线连接起来							  *
 *																					  *
 ***************************************************************************************/
#include "mcs51/8051.h" //此文件中定义了51的一些特殊功能寄存器

void delayms(unsigned char ms)
// 延时子程序
{
    unsigned char i;
    while (ms--) {
        for (i = 0; i < 120; i++)
            ;
    }
}

main() {
    unsigned char LED;
    LED = 0xfe; // 0xfe = 1111 1110
    while (1) {
        P2 = LED;
        delayms(250);
        LED = LED << 1; //循环右移1位，点亮下一个LED "<<"为左移位
        if (P2 == 0x00) {
            LED = 0xfe;
        } // 0xfe = 1111 1110
    }
}
