/******************************************************************/
/* 	      继电器实验						*
/*  连接方法：P2.7接JP5的K1(按钮接口)   
              P1.4接J2                 			  *
/*	按下P2.7 继电器P1.4动作		       		*
/******************************************************************/

       ORG	  0000h
       AJMP  MAIN
       ORG   0030H
MAIN:
       MOV   P2,   #0FFH    	//做读数据时，先初始端口至高电平
 	MOV   A ,    P2
	CJNE  A ,    #0FFH, GO  //不等于时跳转到GO
	SETB  P1.4 			   //置位
	AJMP MAIN 			  

GO:    CLR   P1.4 	           //清零


END								    