/**************************************************************************************
*		              LED闪烁的简单试验												  *
*																					  *
*     连接方法： JP11（P2）和J12用8PIN排线连接起来								      *
*																					  *
***************************************************************************************/	
	ORG 0000H	    ;程序从此地址开始运行
	LJMP MAIN	    ;跳转到 MAIN 程序处

	ORG 030H	    ;MAIN 从030H处开始
MAIN:	
  	MOV P2 ,#00H    ;P2为低电平 LED 灯亮
	ACALL DELAY		;调用延时子程序
	MOV P2 ,#0FFH
	ACALL DELAY
	AJMP MAIN        ;跳转到主程序处

DELAY:	MOV R5,#04H	   ;将立即数传给寄存器R5
F3:	MOV R6,#0FFH
F2:	MOV R7,#0FFH
F1:	DJNZ R7,F1	       ;若为0程序向下执行，若不为0程序跳转到
	DJNZ R6,F2
	DJNZ R5,F3
	RET
	END
