/********************************************************************************
;                  二进制加法试验												*
; p2口八个灯作二进制加法。理解二进值的计算                                  	*
; 硬件连接：p2口8路指示灯														*
;																				*
;*  描述:                                                                       *
;   p2口八个灯作二进制加法。理解二进值的计算                                    *
;*  连接方法： JP11（P2）和J12(LED灯) 用8PIN排线连接起来                        *
*********************************************************************************/
#include "/usr/share/sdcc/include/mcs51/8051.h"

void delay(unsigned int i); //声明延时函数

main() {
    unsigned char Num = 0xff;
    while (1) {
        P2 = Num;
        delay(1000); //延时函数
        Num--;
    }
}

/*******延时函数*************/
void delay(unsigned int i) {
    unsigned char j;
    for (i; i > 0; i--)
        for (j = 255; j > 0; j--)
            ;
}
