/****************************************************************************
*                 138译码器实验                                             *
*                                                                           *
* 实验目的：  1. 了解138译码器工作原理                                      *
*             2.  学会用C语言对138译码器编程控制                            *
*                                                                           *
* 实验现象：  LED灯每隔一段时间循环点亮                                     *
* 接线方法： * 接线方法：  J15连JP12
              P2.2、P2.3、P2.4分别连P6的A、B、C                                       *
*****************************************************************************/
#include "mcs51/8051.h"

#define HC138A P2_2 //定义译码器输入端A 在 P2.2 管脚上
#define HC138B P2_3 //定义译码器输入端B 在 P2.3 管脚上
#define HC138C P2_4 //定义译码器输入端C 在 P2.4 管脚上

/*************************************************
 *
 *                  延时函数
 *
 **************************************************/
void delay(unsigned int i) {
    unsigned char j;
    for (i; i > 0; i--) //循环1500*255次 CPU在这里执行一段时间
        for (j = 255; j > 0; j--)
            ;
}

main() {

    while (1) {
        // 点亮第一个LED灯
        HC138C = 0;
        HC138B = 0;
        HC138A = 0;  //输入 000
        delay(1500); //延时

        // 点亮第二个LED灯
        HC138C = 0;
        HC138B = 0;
        HC138A = 1;  //输入 001
        delay(1500); //延时

        // 点亮第三个LED灯
        HC138C = 0;
        HC138B = 1;
        HC138A = 0; //输入 010
        delay(1500);

        // 点亮第四个LED灯
        HC138C = 0;
        HC138B = 1;
        HC138A = 1; //输入 011
        delay(2000);

        // 点亮第五个LED灯
        HC138C = 1;
        HC138B = 0;
        HC138A = 0; //输入 100
        delay(1500);

        // 点亮第六个LED灯
        HC138C = 1;
        HC138B = 0;
        HC138A = 1; //输入 101
        delay(1500);

        HC138C = 1;
        HC138B = 1;
        HC138A = 0; //输入 110
        delay(1500);

        HC138C = 1;
        HC138B = 1;
        HC138A = 1; //输入 111
        delay(1500);
    }
}
