/**************************************************************************************
*		              LED闪烁的简单试验												  *
*	
*     连接方法： JP11（P2）和J12用8PIN排线连接起来								      *
*																					  *
***************************************************************************************/

#include <reg51.h>	   //此文件中定义了51的一些特殊功能寄存器

void delay(unsigned int i);  //声明延时函数
int num;
sbit P2_0= P2^0;			 

main()
{ 
    TMOD= 0X10;						//定时器1的工作方式1
    EA= 1;							//开启总中断
	ET1= 1;							//开启定时器中断1
    TH1= 0x3c;						//高位赋初值
	TL1= 0xb0;						//低位赋初值	 3cb0是15535，则计时为（65535-15535=50000）us，即50ms
	TR1= 1;							//启动定时器	T1
	num= 0;
   while(1)
   {
   P2_0= num;
   }
}

/*******延时函数*************/


void int_1()interrupt 3
{

	unsigned char n;

		TH1= 0x3c;
		TL1= 0xb0;					 //3cb0是15535，则计时为（65535-15535=50000）us，即50ms
		TR1= 1;
		n++;
		if(n==10)					 //0.5s  num加1
		{
			num=~num;
			n= 0;
		}
	  
	}












